package sprint03.z_final.a;

/*
* Работа бинарного поиска в сдвинутом отсортированном массиве (binarySearchByBrokenSortedArray):
* Если левая граница меньше или равна правой - выходим т.к. на предыдущем шаге мы уже проверили центральный элемент,
* который на текущей итерации является левая или правая граница.
* Находим центральный элемент, который поделит текущие границы массива пополам (почти).
* Если значение центрального элемента равно искомому, выводим индекс центрального элемента и завершаем обработку.
* Определяем сломан левый или правый подмассив:
*   Если крайний левый элемент больше центрального - сломан левый массив.
*   Если крайний правый элемент меньше центрального - сломан правый массив.
* Если сломан левый массив, проверяем входит ли искомый элемент в диапазон элементов правого массива, если входит
* продолжаем поиск в правом массиве, если нет - в левом.
* Если сломан правый массив, проверяем входит ли искомый элемент в левый массив, если входит продолжаем
* поиск в левом массиве, если не входит - в правом.
* Если правый и левый массивы не сломаны, значит массив целиком отсортирован - запускаем обычный бинарный поиск:
*   Если искомый элемент входит в левый диапазон, запускаем поиск в левом подмассиве, иначе в правом.
* */
//Отчет: https://contest.yandex.ru/contest/23815/run-report/161698050/
public class Solution {

    public static int brokenSearch(int[] arr, int k) {
        int left = 0;
        int right = arr.length;
        while (left < right) {
            int mid = (left + right) / 2;
            if (arr[mid] == k) {
                return mid;
            }
            if (arr[left] > arr[mid]) {
                if (arr[mid + 1] <= k && k <= arr[right -1]) {
                    left = mid + 1;
                } else {
                    right = mid;
                }
            } else if (arr[mid] > arr[right - 1]) {
                if (arr[left] <= k && k <= arr[mid]) {
                    right = mid;
                } else {
                    left = mid + 1;
                }
            } else {
                if (k < arr[mid]) {
                    right = mid;
                } else {
                    left = mid + 1;
                }
            }
        }
        return -1;
    }


    private static void test() {
        int[] arr = {19, 21, 100, 101, 1, 4, 5, 7, 12};
        assert 6 == brokenSearch(arr, 5);
    }
}